docs/org/json.org
#+TITLE: JSON
#+AUTHOR: Petros Papapanagiotou
#+EMAIL: petros@workflowfm.com
#+OPTIONS: toc:nil email:t 
#+EXCLUDE_TAGS: noexport
#+PROPERTY: header-args :results output drawer :session workflowfm :exports both :eval no-export :dir ../../
#+HUGO_AUTO_SET_LASTMOD: t

#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: docs/json

* Commands
  :PROPERTIES:
  :EXPORT_FILE_NAME: commands
  :EXPORT_HUGO_WEIGHT: 420
  :END:

JSON commands can be issued to the WorkflowFM Reasoner using the following function:
#+BEGIN_SRC ocaml :eval no
Json_composer_io.execute "JSON";;
#+END_SRC 

Replace ~JSON~ with one of the commands described below, in JSON format.

You can also execute a JSON command stored in a file as follows:
#+BEGIN_SRC ocaml :eval no
Json_composer_io.execute_file "path/to/file.json";;
#+END_SRC 


{{< tip >}}
All commands include a ~command~ field of type ~string~ which defines the type of the command.
{{< /tip >}}

** Ping
   :PROPERTIES:
   :CUSTOM_ID: PingCommand
   :END:

**** Description:

 Ping/keep-alive command. Gives a [[#PongResponse][~Pong~]] response.

**** Structure:
 - ~command~: ~string~ = ~"ping"~
 - ~ping~: ~float~ = a timestamp to measure ping

** Create
   :PROPERTIES:
   :CUSTOM_ID: CreateCommand
   :END:

**** Description:

 A command to create a new atomic process. 

**** Structure:
 - ~command~: ~string~ = ~"create"~
 - ~name~: ~string~ = the name of the process to be created
 - ~inputs~: ~array~ of [[#linprop][~linprop~]] = a list of inputs. Their channels will be created by the prover.
 - ~output~: [[#linprop][~linprop~]] = the process output. The channcel will be created by the prover.

** Binary compose (compose1)
   :PROPERTIES:
   :CUSTOM_ID: Compose1Command
   :END:
**** Description:

 Binary composition of 2 processes with a single action. 

 Although a more general [[#ComposeCommand][composition command]] is provided, when it comes to simple binary compositions this command executes faster.

**** Structure:
 - ~command~: ~string~ = ~"compose1"~
 - ~action~: [[#action][~action~]] = the composition action to be performed. The labels of the 2 arguments must match the labels of the processes provided in the next fields.
 - ~lhs~: [[#process][~process~]] = the process corresponding to the first (left) argument of the action
 - ~rhs~: [[#process][~process~]] = the process corresponding to the second (right) argument of the action

** Compose
   :PROPERTIES:
   :CUSTOM_ID: ComposeCommand
   :END:

**** Description:

 Construction of a complex composition with one or more actions. Although more general than the binary composition command [[#Compose1Command][~compose1~]], it is slower.

**** Structure:
 - ~command~: ~string~ = ~"compose"~
 - ~name~: ~string~ = the name of the final composition
 - ~components~: ~array~ of [[#process][~process~]] = the list of all component processes that will be used
 - ~actions~: ~array~ of [[#action][~action~]] = the ordered list of actions to be performed

** Verify
   :PROPERTIES:
   :CUSTOM_ID: VerifyCommand
   :END:
**** Description:

 A command used to reconstruct a process composition. 

 This is legacy command which has now devolved into the [[#ComposeCommand][~compose~]] command. The only difference is that ~verify~ does not produce [[#ComposeResponse][~compose~]] responses for intermediate steps. It will only generate one [[#VerifyResponse][~verify~]] response for the final process.

**** Structure:
 - ~command~: ~string~ = ~"verify"~
 - ~name~: ~string~ = the name of the final composition
 - ~components~: ~array~ of [[#process][~process~]] = the list of all component processes that will be used
 - ~actions~: ~array~ of [[#action][~action~]] = the ordered list of actions to be performed

** Deploy
   :PROPERTIES:
   :CUSTOM_ID: DeployCommand
   :END:
**** Description:

 This is a family of commands that produce executable process deployments.

 There are currently 3 types of possible deployments:
 1. ~PiViz~: This produces a file for the PiVizTool and/or MWB.
 2. ~PiLib~: This produces a deployment and code templates using the old PiLib library.
 3. ~PEW~: This produces a deployment and code templates with the newer [[https://github.com/workflowfm/pew][PEW library]].

**** Structure:

**** ~PiViz~
 - ~command~: ~string~ = ~"piviz"~
 - ~process~: [[#process][~process~]] = the process to be deployed
 - ~components~: ~array~ of [[#process][~process~]] = the list of all dependencies/components required in the composition

**** ~PiLib~
 - ~command~: ~string~ = ~"pilib"~
 - ~process~: [[#process][~process~]] = the process to be deployed
 - ~components~: ~array~ of [[#process][~process~]] = the list of all dependencies/components required in the composition
 - ~separator~: ~string~ = the client OS-specific file path separator 
 - ~path~: ~string~ = the base path for the deployment
 - ~pkg~: ~string~ = the desired name for the Scala package that will contain the code
 - ~project~: ~string~ = an identifiable name for the deployment. This will be used to identify certain types and classes.
 - ~main~: ~bool~ = ~true~ if the generation of a template for a main class is required.
- ~java~: ~bool~ = ~true~ if the generation of a java runner class is required. This can help integrate the Scala deployment with Java code.
  
**** ~PEW~
 - ~command~: ~string~ = ~"piviz"~
 - ~process~: [[#process][~process~]] = the process to be deployed
 - ~components~: ~array~ of [[#process][~process~]] = the list of all dependencies/components required in the composition
 - ~separator~: ~string~ = the client OS-specific file path separator 
 - ~path~: ~string~ = the base path for the deployment
 - ~pkg~: ~string~ = the desired name for the Scala package that will contain the code
 - ~project~: ~string~ = an identifiable name for the deployment. This will be used to identify certain types and classes.
 - ~main~: ~bool~ = ~true~ if the generation of a template for a main class is required.
- ~java~: ~bool~ = ~true~ if the generation of a java runner class is required. This can help integrate the Scala deployment with Java code.

